package Day05;

/**
 * @program: Data_Study
 * @description: 方法的介绍
 * @author: HaoMiao
 * @create: 2019-10-26 22:03
 **/
public class MethodTest {
    /**
     * 注意：方法不能写在方法里面（类里面，方法外面）
     *      修饰符 返回值类型 方法名（形参类型 形参名，形参类型 形参名，。。。$参数列表$）{方法体}
     *      1.修饰符：public 公共的；static 静态的；
     *      2.返回值类型：数据类型（基本数据类型，引用数据类型）都可以
     *          还可以是void（空）：没有返回值
     *      3.方法名：自己取名，小驼峰！（第一个单词首字母小写，其他单词首字母大写）
     *      4.形参类型：
     *          形式参数：具有参数形式，没有具体值
     *          实际参数：具体值
     *          类型：基本数据类型，引用数据类型
     *          形参名：取名小写！
     *          可以是多个形参类型 形参名
     *      5.方法体：
     *          要完成特定功能的代码块！
     *          return：返回你规定的返回值类型的数据 ---> return 值；
     *          如果返回值类型是void，就可以不写return，或者return ；
     */
    public static void main(String[] args) {

    }
}
